* Laserdiscs
| Title                                                            | Condition     | Released | Genre            | Media   | Picture     | LDDB         |        Order # | Received? | Notes                                       |
|------------------------------------------------------------------+---------------+----------+------------------+---------+-------------+--------------+----------------+-----------+---------------------------------------------|
| 1776: Special Edition                                            |               |     1992 | Musical          | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/20253/PSE92-23/1776:-Special-Edition][PSE92-23]]     |             x1 |           |                                             |
| Age of Innocence, The                                            | Very Good     |     1994 | Drama            | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/05556/52636/Age-of-Innocence-The][52636]]        | 25-04063-15677 | Yes       |                                             |
| Aladdin                                                          | Near Mint     |     1994 | Animation        | CAV     | Letterbox   | [[https://www.lddb.com/laserdisc/05799/1662-CS/Aladdin][1662-CS]]      | 24-04148-69431 | Yes       |                                             |
| All the President's Men                                          | Good          |     1994 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/20354/1018/All-the-President's-Men][1018]]         | 02-04046-90047 | Yes       |                                             |
| Bambi (55th Anniversary Limited Edition)                         | Very Good     |     1997 | Animated         | CAV     | Fullscreen  | [[https://www.lddb.com/laserdisc/07508/9505-CS/Bambi:-55th-Anniversary-Limited-Edition][9505-CS]]      | 11-04072-02128 | Yes       |                                             |
| Beauty and the Beast                                             | Very Good     |     1993 | Animation        | CAV     | Letterbox   | [[https://www.lddb.com/laserdisc/05155/1325-CS/Beauty-and-the-Beast][1325-CS]]      | 24-04148-69431 | Yes       |                                             |
| Beauty and the Beast                                             | Very Good     |     1993 | Animation        | CAV     | Letterbox   | [[https://www.lddb.com/laserdisc/05155/1325-CS/Beauty-and-the-Beast][1325-CS]]      | 11-04072-02128 | Yes       |                                             |
| Blade Runner: Director's Cut                                     |               |     1993 | Sci-Fi           | CAV     | Letterbox   | [[https://www.lddb.com/laserdisc/04904/12682/Blade-Runner:-Director's-Cut][12682]]        | 18-04154-08121 |           |                                             |
| Blow Out                                                         | Cutout        |     1997 | Thriller         | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05406/ID2588OR/Blow-Out][ID2588OR]]     | 02-04046-90047 | Yes       |                                             |
| Body Heat                                                        | Good          |     1984 | Thriller         | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/21504/20005-LV/Body-Heat][20005-LV]]     | 25-04063-15677 | Yes       |                                             |
| Bonnie and Clyde                                                 | Near Mint     |     1996 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06866/14299/Bonnie-and-Clyde][14299]]        | 18-04050-46304 | Yes       |                                             |
| Born on the Fourth of July                                       |               |          | Action           |         |             |              | 18-04050-46304 |           |                                             |
| Bounty, The                                                      | Near Mint     |     1984 | Adventure        | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/40140/VL5044/Bounty-The][VL5044]]       | 25-04063-15677 | Yes       |                                             |
| Bram Stoker's Dracula: Special Collector's Edition               | Very Good     |     1993 | Horror           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/04987/53436/Bram-Stoker's-Dracula:-Special-Collector's-Edition][53436]]        | 03-04164-16065 | Yes       |                                             |
| Braveheart                                                       | Very Good     |     1996 | Adventure        | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/18656/LV-33118-2WS/Braveheart][LV-33118-2WS]] | 11-04072-02127 | Yes       |                                             |
| Braveheart                                                       |               |     1996 | Adventure        | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/18656/LV-33118-2WS/Braveheart][LV-33118-2WS]] |             x1 | Yes       |                                             |
| Bridge on the River Kwai, The                                    | Near Mint     |     1994 | Drama            | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/05565/79616/Bridge-on-the-River-Kwai-The][79616]]        | 25-04063-15677 | Yes       |                                             |
| Casino                                                           | Very Good     |     1996 | Drama            | CLV+CAV | Letterbox   |              | 11-04072-02127 |           |                                             |
| Clear and Present Danger                                         |               |          | Drama            |         |             |              | 02-04046-90047 |           |                                             |
| Cliffhanger (Pioneer Special Edition)                            | Good          |     1995 | Action           | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/20227/PSE95-56/Cliffhanger:-Special-Edition][PSE95-56]]     | 12-04069-75173 | Yes       |                                             |
| Close Encounters of the Third Kind: Special Edition              |               |     1994 | Sci-Fi           | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/05956/76866/Close-Encounters-of-the-Third-Kind:-Special-Edition][76866]]        |         262096 |           |                                             |
| Color of Money, The                                              | Very Good     |          | Drama            | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/00622/513-AS/Color-of-Money-The][513-AS]]       | 22-04128-99509 | Yes       |                                             |
| Crimson Tide                                                     | Very Good     |     1995 | Thriller         | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06711/5255-AS/Crimson-Tide][5255-AS]]      | 25-04063-15677 | Yes       |                                             |
| Crying Game, The                                                 | Very Good     |     1993 | Drama            | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/21530/LD-69039/Crying-Game-The][LD-69039]]     | 25-04063-15677 | Yes       |                                             |
| Dances with Wolves                                               |               |          |                  |         |             |              | 02-04046-90047 |           |                                             |
| Dangerous Liaisons                                               | Near Mint     |     1988 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/02218/11872-A/B/Dangerous-Liaisons][11872-A/B]]    | 25-04063-15677 | Yes       |                                             |
| Days of Heaven                                                   |               |          |                  |         | Letterbox   |              | 02-04046-90047 |           |                                             |
| Dead Again                                                       |               |     1992 | Thriller         | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/21533/LV32057-WS/Dead-Again][LV32057-WS]]   |         262096 |           |                                             |
| Dead Man Walking                                                 | Mostly Sealed |     1996 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/21535/800638243-1/Dead-Man-Walking][800638243-1]]  | 02-04046-90047 | Yes       |                                             |
| Death Warrant                                                    | Good          |     1991 | Action           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/03174/ML102170/Death-Warrant][ML102170]]     | 12-04069-75173 | Yes       |                                             |
| Desperate Hours                                                  | Very Good     |     1991 | Thriller         | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/03297/ML102167/Desperate-Hours][ML102167]]     | 22-04128-99509 | Yes       |                                             |
| Devlin                                                           |               |     1993 | Thriller         | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/04678/ID2101ME/Devlin][ID2101ME]]     | 18-04154-08121 |           |                                             |
| Dirty Harry in the Deadpool                                      | Near Mint     |     1989 | Action           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/02203/11810/Dead-Pool-The][11810]]        | 12-04069-75173 | Yes       |                                             |
| Dog Day Afternoon                                                |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Donnie Brasco                                                    |               |          |                  |         |             |              | 02-04046-90047 |           |                                             |
| Dr. Suess' How the Grinch Stole Christmas! / Horton Hears a Who! | Very Good     |     1994 | Animation        | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/05971/ML105107/Dr.-Seuss:-How-the-Grinch-Stole-Christmas!/Horton-Hears-a-Who!][ML105107]]     | 15-04071-27818 | Yes       |                                             |
| Dragonheart                                                      | Near Mint     |     1996 | Fantasy          | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07400/42973/Dragonheart][42973]]        | 21-04090-96305 | Yes       |                                             |
| Dry White Season, A                                              | Very Good     |     1991 | Drama            | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/03121/4768-80/Dry-White-Season-A][4768-80]]      | 12-04069-75173 | Yes       |                                             |
| Empire of the Sun                                                | Near Mint     |     1987 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/22665/11753/Empire-of-the-Sun/The-China-Odyssey][11753]]        | 25-04063-15677 | Yes       |                                             |
| English Patient, The                                             | Very Good     |     1997 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07903/12047-AS/English-Patient-The][12047-AS]]     | 25-04063-15677 | Yes       |                                             |
| F/X                                                              | Good          |          | Thriller         | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/30349/TVL3769/F/X][TVL3769]]      | 22-04128-99509 | Yes       |                                             |
| Falling Down                                                     |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Fantasia                                                         |               |     1991 | Animation        | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/03732/1132-AS/Fantasia][1132-AS]]      | 26-04081-56348 |           |                                             |
| Fire in the Sky                                                  |               |          | Sci-Fi           |         |             |              | 18-04050-46304 |           |                                             |
| Fish Called Wanda, A                                             | Very Good     |     1993 | Comdedy          | CLV     | Open Matte  | [[https://www.lddb.com/laserdisc/04539/ML101247/Fish-Called-Wanda-A][ML101247]]     | 25-04063-15677 | Yes       |                                             |
| For Your Eyes Only                                               | Near Mint     |     1982 | Action           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/51184/4568-80/For-Your-Eyes-Only][4568-80]]      | 25-04063-15677 | Yes       |                                             |
| Four Weddings and a Funderal                                     | Very Good     |     1994 | Comedy           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/28046/800631769-1/Four-Weddings-and-a-Funeral][800631769-1]]  | 25-04063-15677 | Yes       |                                             |
| French Connection, The                                           |               |          |                  |         |             |              | 02-04046-90047 |           |                                             |
| Fugitive, The                                                    | Good          |     1994 | Thriller         | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/05544/21000/Fugitive-The][21000]]        | 25-04063-15677 | Yes       |                                             |
| Gattaca                                                          |               |     1998 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/08265/82646/Gattaca][82646]]        |         262096 |           |                                             |
| Get Shorty                                                       |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Ghostbusters                                                     | Fair          |     1985 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/53039/30413/Ghostbusters][30413]]        |         247054 | Yes       |                                             |
| Ghostbusters                                                     | Very Good     |     1989 | Comedy           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/00951/CC1182L/Ghostbusters][CC1182L]]      | 22-04128-99509 | Yes       |                                             |
| Glory                                                            |               |     1990 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/02797/70286/Glory][70286]]        |         262096 |           |                                             |
| Goldeneye                                                        |               |          | Action           |         |             |              | 02-04046-90047 |           |                                             |
| Groundhog Day                                                    |               |     1993 | Comedy           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05143/52296/Groundhog-Day][52296]]        | 22-04128-99509 |           |                                             |
| Hannah and her Sisters                                           | Very Good     |     1997 | Comedy           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07842/ID3634OR/Hannah-and-Her-Sisters][ID3634OR]]     | 18-04050-46304 | Yes       |                                             |
| Haunting, The                                                    | Very Good     |     1993 | Horror           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05219/ML104605/Haunting-The][ML104605]]     | 21-04155-50108 | Yes       |                                             |
| Hearts of Darkness                                               |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Horror Hotel                                                     | Very Good     |     1995 | Horror           | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/06046/EE0818/Horror-Hotel][EE0818]]       | 03-04164-16065 | Yes       |                                             |
| House in the Hills, A                                            | Good          |     1993 | Thriller         | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/23650/LD-69947/House-in-the-Hills-A][LD-69947]]     | 12-04069-75173 | Yes       | Came in the jacket for 'A Dry White Season' |
| Howards End                                                      | Very Good     |     1993 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/04911/26776/Howards-End][26776]]        | 25-04063-15677 | Yes       |                                             |
| Hud                                                              | Good          |     1994 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/23797/LV6630-WS/Hud][LV6630-WS]]    | 18-04050-46304 | Yes       |                                             |
| Hunt For Red October, The                                        | Good          |     1990 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/21460/LV-32020-2L/Hunt-for-Red-October-The][LV-32020-2L]]  | 25-04063-15677 | Yes       |                                             |
| Husbands and Wives                                               | Very Good     |     1993 | Comedy           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/04741/51556/Husbands-and-Wives][51556]]        | 18-04050-46304 | Yes       |                                             |
| In the Line of Fire                                              |               |          | Action           |         |             |              | 18-04050-46304 |           |                                             |
| Incredible Storydisc, The                                        |               |          | Animation / Game | CAV     | Fullscreen  | [[https://www.lddb.com/laserdisc/35670/OPA-37-610/Incredible-Storydisc-The][OPA-37-610]]   |             x1 |           |                                             |
| Independence Day                                                 | Good          |     1997 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/10956/0411885/Independence-Day:-ID4][0411885]]      |         247054 | Yes       |                                             |
| Invasion of the Body Snatchers #8A                               | Near Mint     |     1989 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/00944/CC1174L/Invasion-of-the-Body-Snatchers][CC1174L]]      | 03-04164-16065 | Yes       |                                             |
| Jane Fonda's Workout                                             | Very Good     |     1982 | Exercise         | CLV     | Fullscreen  |              | 22-04128-99509 | Yes       |                                             |
| Jungle Book, The                                                 | Good          |     1992 | Animation        | CAV     | Fullscreen  | [[https://www.lddb.com/laserdisc/03730/1122-CS/Jungle-Book-The][1122-CS]]      | 11-04072-02128 | Yes       |                                             |
| Jungle Book, The                                                 | Near Mint     |     1992 | Animation        | CAV     | Fullscreen  | [[https://www.lddb.com/laserdisc/03730/1122-CS/Jungle-Book-The][1122-CS]]      | 24-04148-69431 | Yes       |                                             |
| Last Boyscout, The                                               | Very Good     |     1995 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/28132/1221713/Last-Boyscout-The][1221713]]      | 22-04128-99509 | Yes       |                                             |
| Last Detail, The                                                 |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Last of the Mohicans, The                                        | Good          |     1993 | Western          | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/04661/1986-85/Last-of-the-Mohicans-The][1986-85]]      | 25-04063-15677 | Yes       |                                             |
| Last Picture Show, The                                           |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Leaving Las Vegas                                                |               |          |                  |         |             |              | 02-04046-90047 |           |                                             |
| Legends of the Fall                                              |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Little Women                                                     | Very Good     |     1995 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06426/01026/Little-Women][01026]]        | 25-04063-15677 | Yes       |                                             |
| Lonely are the Brave                                             |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Long Goodbye, The                                                |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Longest Day, The                                                 | Mint          |     1989 | War              | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/22609/1021-80/Longest-Day-The][1021-80]]      |         533154 |           |                                             |
| Love Among the Ruins                                             | Sealed        |     1990 | Romance          | CLV     | Open Matte  | [[https://www.lddb.com/laserdisc/00907/8038-80/Love-Among-The-Ruins][8038-80]]      |         247054 | Yes       |                                             |
| Man in the Moon, The                                             | Cutout        |     1992 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/04294/ML102500/Man-in-the-Moon-The][ML102500]]     |         533154 |           |                                             |
| Man Who Would Be King, The                                       |               |     1998 | Adventure        | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/08250/858/Man-Who-Would-Be-King-The][858]]          |         533154 |           |                                             |
| Manchurian Candidate, The                                        | Good          |          | Thriller         | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/02102/ML101369/Manchurian-Candidate-The][ML101369]]     | 25-04063-15677 | Yes       |                                             |
| Mary Poppins (Exclusive Archive Edition)                         | Mint          |     1993 | Family           | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/04578/1588-CS/Mary-Poppins][1588-CS]]      | 11-04072-02128 | Yes       |                                             |
| Men In Black                                                     | Very Good     |     1997 | Sci-Fi           | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/08025/82656/Men-in-Black][82656]]        |         247054 | Yes       |                                             |
| Mickey's Christmas Carol                                         | Very Good     |     1990 | Animation        | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/18626/459-AS/Mickey's-Christmas-Carol][459-AS]]       | 15-04071-27818 | Yes       |                                             |
| Midnight Run                                                     |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Miller's Crossing                                                |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Mr. Holland's Opus                                               |               |     1996 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07158/5779-AS/Mr.-Holland's-Opus][5779-AS]]      |         262096 |           |                                             |
| National Lampoon's Vacation                                      | Very Good     |     1991 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/02166/11315/National-Lampoon's-Vacation][11315]]        | 11-04072-02127 | Yes       |                                             |
| Night to Remember, A                                             |               |          | Comedy           | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/00657/32000/Night-to-Remember-A][32000]]        | 18-04154-08121 |           |                                             |
| North by Northwest                                               | Very Good     |     1991 | Thriller         | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/03508/ML102228/North-by-Northwest][ML102228]]     | 25-04063-15677 | Yes       |                                             |
| Off Beat                                                         | Near Mint     |          | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/00629/455-AS/Off-Beat][455-AS]]       | 22-04128-99509 | Yes       |                                             |
| Omen, The                                                        | Near Mint     |     1998 | Horror           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/23380/0890985/Omen-The][0890985]]      | 03-04164-16065 | Yes       |                                             |
| Omen, The                                                        | Very Good     |     1988 | Horror           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/10585/1079-80/Omen-The][1079-80]]      | 12-04069-75173 | Yes       |                                             |
| On Deadly Ground                                                 | Good          |     1994 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05775/13227/On-Deadly-Ground][13227]]        | 11-04072-02127 | Yes       |                                             |
| Out of Africa                                                    |               |     1986 | Drama            | CLV     | Open Matte  | [[https://www.lddb.com/laserdisc/02005/40350/Out-of-Africa][40350]]        |         533154 |           |                                             |
| Pee Wee's Playhouse: Christmas Special                           |               |     1990 | Family           | CLV     |             | [[https://www.lddb.com/laserdisc/02882/ID7233ME/Pee-Wee's-Playhouse:-Christmas-Special][ID7233ME]]     | 26-04081-56348 |           |                                             |
| Pete's Dragon                                                    |               |     1991 | Family           | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/10888/010-AS/Pete's-Dragon][010-AS]]       | 26-04081-56348 |           |                                             |
| Player, The                                                      |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Prince and the Pauper, The                                       | Near Mint     |     1991 | Animation        | CLV/CAV | Fullscreen  | [[https://www.lddb.com/laserdisc/03742/1191-AS/Prince-and-the-Pauper-The][1191-AS]]      | 24-04148-69431 | Yes       |                                             |
| Quiet Man, The: 40th Anniversary Edition                         | Good          |     1992 | Drama            | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/09595/LV23361/Quiet-Man-The:-40th-Anniversary-Edition][LV23361]]      |         247054 | Yes       |                                             |
| Rapa-Nui                                                         |               |     1995 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/10914/13003/Rapa-Nui][13003]]        |         262096 |           |                                             |
| Rescuers Down Under, The                                         | Near Mint     |     1991 | Animation        | CAV     | Open Matte  | [[https://www.lddb.com/laserdisc/03783/1142-CS/Rescuers-Down-Under-The][1142-CS]]      | 24-04148-69431 | Yes       |                                             |
| Reservoir Dogs                                                   | Very Good     |     1993 | Crime            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/19102/LD68993WS/Reservoir-Dogs][LD68993WS]]    | 12-04069-75173 | Yes       |                                             |
| Richard III                                                      |               |          |                  |         |             |              | 18-04050-46304 |           |                                             |
| Road Warrior, The                                                | Very Good     |     1994 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05667/13346/Mad-Max-2:-The-Road-Warrior][13346]]        | 12-04069-75173 | Yes       |                                             |
| Rocky V                                                          | Very Good     |     1991 | Drama            | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/03318/ML102218/Rocky-V][ML102218]]     | 12-04069-75173 | Yes       | Need to replace inner sleeve.               |
| Room with a View, A                                              | Very Good     |     1987 | Drama            | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/10729/6915-80/Room-with-a-View-A][6915-80]]      | 25-04063-15677 | Yes       |                                             |
| Ruling Class, The                                                |               |     1987 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/02471/ID7556NL/Ruling-Class-The][ID7556NL]]     | 18-04154-08121 |           |                                             |
| Ruthless People                                                  |               |     1986 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/00620/485-AS/Ruthless-People][485-AS]]       | 22-04128-99509 |           |                                             |
| Schindler's List: Collector's Edition                            | Sealed        |     1994 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/05880/42132/Schindler's-List:-Collector's-Edition][42132]]        | 06-04163-21527 |           |                                             |
| Sea of Love                                                      |               |          | Thriller         | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/02691/41007/Sea-of-Love][41007]]        |         262096 |           |                                             |
| Secret of my Success, The                                        | Good          |     1988 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/02028/40637/Secret-of-my-Success-The][40637]]        | 22-04128-99509 | Yes       |                                             |
| Seventh Seal                                                     |               |     1990 | Drama            | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/00965/CC1212L/Seventh-Seal-The][CC1212L]]      |                |           |                                             |
| Sleeping Beauty                                                  | Very Good     |          | Animation        | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/00792/476-AS/Sleeping-Beauty][476-AS]]       | 11-04072-02128 | Yes       |                                             |
| Sleeping Beauty (Limited Edition)                                | Near Mint     |     1997 | Animation        | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07895/9511-AS/Sleeping-Beauty][9511-AS]]      | 15-04071-27818 | Yes       |                                             |
| Sleeping Beauty (Limited Edition)                                | Very Good     |     1997 | Animation        | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07895/9511-AS/Sleeping-Beauty][9511-AS]]      | 11-04072-02128 | Yes       |                                             |
| Sound of Music, The                                              |               |     1996 | Musical          | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/10937/0897280/Sound-of-Music-The][0897280 ?]]    | 26-04081-56348 |           |                                             |
| Speed                                                            | Very Good     |     1994 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06062/8638-85/Speed][8638-85]]      | 11-04072-02127 | Yes       |                                             |
| Star Wars Trilogy Special Edition                                | Near Mint     |     1997 | Sci-Fi           | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/07972/4102985/Star-Wars-Trilogy:-Special-Edition][4102985]]      | 14-04079-14183 | Yes       |                                             |
| Starship Troopers                                                |               |     1998 | Sci-Fi           | CLV/CAV | Letterbox   | [[https://www.lddb.com/laserdisc/08267/71716/Starship-Troopers][71716]]        |         262096 |           |                                             |
| Stepfather, The                                                  | Fair          |     1987 | Horror           | CLV     | Open Matte  | [[https://www.lddb.com/laserdisc/23332/75676/Stepfather-The][75676]]        | 12-04069-75173 | Yes       | Need to replace inner sleeve.               |
| Street Figher the Movie (Signature Collection)                   | Good          |     1995 | Action           | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/06423/42404/Street-Fighter][42404]]        | 12-04069-75173 | Yes       |                                             |
| Street Figher, The                                               | Very Good     |     1995 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06888/ID3368LI/Street-Fighter-The][ID3368LI]]     | 12-04069-75173 | Yes       |                                             |
| Sword in the Stone, The                                          |               |     1986 | Animation        | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/24999/229-AS/Sword-in-the-Stone-The][229-AS]]       | 26-04081-56348 |           |                                             |
| Thief and the Cobbler, The                                       |               |     1997 | Animation        | CLV     | Letterboxed | [[https://www.lddb.com/laserdisc/07516/4611-AS/Thief-and-the-Cobbler-The][4611-AS]]      | 26-04081-56348 |           |                                             |
| Thing, The                                                       | Near Mint     |     1990 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/02766/40946/Thing-The][40946]]        | 03-04164-16065 | Yes       |                                             |
| Time Cop                                                         | Near Mint     |     1995 | Sci-Fi           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/06204/42242/Timecop][42242]]        | 12-04069-75173 | Yes       |                                             |
| Titanic                                                          | Very Good     |     1998 | Drama            | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/18657/LV334812-WS/Titanic][LV334812-WS]]  |         262096 | Yes       |                                             |
| Top Gun                                                          |               |     1995 | Action           | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/21964/LV-1692-WS/Top-Gun][LV-1692-WS]]   | 12-04069-75173 | Yes       |                                             |
| Toy Story                                                        | Good          |     1996 | Animation        | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/07256/6703-AS/Toy-Story][6703-AS]]      | 15-04071-27818 | Yes       |                                             |
| Twins                                                            | Good          |     1989 | Comedy           | CLV     | Pan & Scan  | [[https://www.lddb.com/laserdisc/00790/40873/Twins][40873]]        | 12-04069-75173 | Yes       |                                             |
| Ultimate Oz, The (The Definitive Collector's Edition)            | Very Good     |     1993 | Musical          | CLV/CAV | Fullscreen  | [[https://www.lddb.com/laserdisc/05251/ML103990/Wizard-of-Oz-The:-The-Ultimate-Oz---Collector's-Edition][ML103990]]     | 11-04072-02128 | Yes       |                                             |
| Unforgiven                                                       | Very Good     |     1993 | Western          | CLV+CAV | Letterbox   | [[https://www.lddb.com/laserdisc/05014/12531/Unforgiven][12531]]        |         247054 | Yes       |                                             |
| Video Essentials                                                 |               |          |                  |         |             |              | 01-04074-95604 |           |                                             |
| West Side Story                                                  |               |     1989 | Musical          | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/00986/CC1192L/West-Side-Story][CC1192L]]      |                |           |                                             |
| Who Framed Roger Rabbit                                          |               |          | Comedy           | CAV     | Letterbox   | [[https://www.lddb.com/laserdisc/55733/940-CS/Who-Framed-Roger-Rabbit][940-CS]]       | 26-04081-56348 |           |                                             |
| Winnie the Pooh and Friends                                      |               |          | Animation        | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/00575/226-AS/Winnie-the-Pooh-amp%3B-Friends][226-AS]]       | 26-04081-56348 |           |                                             |
| Winnie the Pooh: and the Honey Tree/Tigger Too                   |               |          | Animation        | CLV     | Fullscreen  | [[https://www.lddb.com/laserdisc/00630/521-AS/Winnie-the-Pooh:-amp%3B-Honey-Tree/Tigger-Too][521-AS]]       | 26-04081-56348 |           |                                             |
| Wyatt Earp                                                       | Near Mint     |     1994 | Western          | CLV     | Letterbox   | [[https://www.lddb.com/laserdisc/09146/13177/Wyatt-Earp][13177]]        |         533154 |           |                                             |


|        Order # |       Date |  Price |   S&H |   Tax |  Total | Seller                           |
|----------------+------------+--------+-------+-------+--------+----------------------------------|
| 02-04046-90047 | 10-24-2019 |  20.00 |  2.45 |  8.47 |  30.92 | lindsathompso_51 (ebay)          |
| 18-04050-46304 | 10-26-2019 |  40.00 |  4.71 | 14.71 |  59.42 | lindsathompso_51 (ebay)          |
| 25-04063-15677 | 10-29-2019 |  26.00 |  3.70 | 17.02 |  46.72 | itsyourbigday (ebay)             |
| 12-04069-75173 | 10-30-2019 |  30.00 |  3.40 |  9.51 |  42.91 | cpsystem3 (ebay)                 |
| 15-04071-27818 | 10-30-2019 |  15.00 |  0.00 |  1.29 |  16.29 | upfatkid13 (ebay)                |
| 11-04072-02127 | 10-30-2019 |   9.99 |  4.83 |  1.12 |  15.94 | stevsmit420 (ebay)               |
| 11-04072-02128 | 10-30-2019 |  20.00 |  5.00 |  2.30 |   27.3 | adolfreyno (ebay)                |
| 01-04074-95604 | 10-31-2019 |  26.99 |  3.27 |  2.60 |  32.86 | insidethecapsules (ebay)         |
| 14-04079-14183 | 11-01-2019 |  44.99 |  0.00 |  3.87 |  48.86 | hanzodiscs (ebay)                |
| 26-04081-56348 | 11-02-2019 |  20.00 |  5.00 |  2.15 |  27.15 | adolfreyno (ebay)                |
|             x1 | 11-02-2019 |  10.97 |  0.00 |  1.10 |  12.07 | Goodwill (Redmond)               |
|         533154 | 11-02-2019 |  31.94 |  0.00 |  3.19 |  35.13 | Half Price Books #022            |
|         262096 | 11-02-2019 |  34.91 |  0.00 |  3.49 |   38.4 | Half Price Books #054            |
| 21-04090-96305 | 11-04-2019 |   4.00 |  3.79 |  0.67 |   8.46 | collectiville (ebay)             |
|         247054 | 11-10-2019 |  24.96 |  0.00 |  2.50 |  27.46 | Half Price Books #048            |
| 22-04128-99509 | 11-12-2019 |  20.00 | 10.00 |  2.58 |  32.58 | ki_643992 (ebay)                 |
| 24-04148-69431 | 11-15-2019 |  15.00 |  4.83 |  1.71 |  21.54 | theultimateshoppingcenter (ebay) |
| 18-04154-08121 | 11-18-2019 |  12.88 |  0.00 |  1.11 |  13.99 | 11secondz06 (ebay)               |
| 21-04155-50108 | 11-18-2019 |   4.19 |  2.75 |  0.60 |   7.54 | carpejaim (ebay)                 |
| 06-04163-21527 | 11-19-2019 |   9.95 |  6.00 |  1.37 |  17.32 | recordhound2 (ebay)              |
| 03-04164-16065 | 11-19-2019 |  20.00 |  5.87 |  2.22 |  28.09 | 82riv (ebay)                     |
|----------------+------------+--------+-------+-------+--------+----------------------------------|
|                |            | 441.77 |  65.6 | 83.58 | 590.95 |                                  |
#+TBLFM: $6=vsum($3..$5)::@23$3=vsum(@I..@II)::@23$4=vsum(@I..@II)::@23$5=vsum(@I..@II)::@23$6=vsum(@I..@II)

** DONE Add this file to personal github and merge changes from copy in Google Drive
   CLOSED: [2019-11-19 Tue 19:10]

